Implement updates for better performance
